<?xml version="1.0" encoding="UTF-8"?>
<net batch="1" name="instance-segmentation-security-0010" version="6">
	<layers>
		<layer id="0" name="im_info" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="1128/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="2" name="1128" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="642/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4" size="48"/>
			</blobs>
		</layer>
		<layer id="4" name="im_data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>800</dim>
					<dim>1344</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="ScaleShift/Add_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>800</dim>
					<dim>1344</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>800</dim>
					<dim>1344</dim>
				</port>
			</output>
			<blobs>
				<weights offset="52" size="12"/>
				<biases offset="64" size="12"/>
			</blobs>
		</layer>
		<layer id="6" name="733" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="64" pads_begin="3,3" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>800</dim>
					<dim>1344</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>400</dim>
					<dim>672</dim>
				</port>
			</output>
			<blobs>
				<weights offset="76" size="37632"/>
				<biases offset="37708" size="256"/>
			</blobs>
		</layer>
		<layer id="7" name="735" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>400</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>400</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="736" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>400</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="737" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="37964" size="65536"/>
				<biases offset="103500" size="1024"/>
			</blobs>
		</layer>
		<layer id="10" name="739" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="740" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="104524" size="73728"/>
				<biases offset="178252" size="1024"/>
			</blobs>
		</layer>
		<layer id="12" name="742" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="743" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="179276" size="262144"/>
				<biases offset="441420" size="1024"/>
			</blobs>
		</layer>
		<layer id="14" name="745" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="442444" size="65536"/>
				<biases offset="507980" size="1024"/>
			</blobs>
		</layer>
		<layer id="15" name="747" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="748" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="749" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="509004" size="262144"/>
				<biases offset="771148" size="1024"/>
			</blobs>
		</layer>
		<layer id="18" name="751" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="752" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="772172" size="73728"/>
				<biases offset="845900" size="1024"/>
			</blobs>
		</layer>
		<layer id="20" name="754" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="755" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="846924" size="262144"/>
				<biases offset="1109068" size="1024"/>
			</blobs>
		</layer>
		<layer id="22" name="757" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="758" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="759" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1110092" size="262144"/>
				<biases offset="1372236" size="1024"/>
			</blobs>
		</layer>
		<layer id="25" name="761" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="762" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1373260" size="73728"/>
				<biases offset="1446988" size="1024"/>
			</blobs>
		</layer>
		<layer id="27" name="764" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="765" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1448012" size="262144"/>
				<biases offset="1710156" size="1024"/>
			</blobs>
		</layer>
		<layer id="29" name="767" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="768" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="1085" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1711180" size="262144"/>
				<biases offset="1973324" size="1024"/>
			</blobs>
		</layer>
		<layer id="32" name="769" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1974348" size="524288"/>
				<biases offset="2498636" size="2048"/>
			</blobs>
		</layer>
		<layer id="33" name="771" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="772" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2500684" size="294912"/>
				<biases offset="2795596" size="2048"/>
			</blobs>
		</layer>
		<layer id="35" name="774" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="775" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2797644" size="1048576"/>
				<biases offset="3846220" size="2048"/>
			</blobs>
		</layer>
		<layer id="37" name="777" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>200</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3848268" size="524288"/>
				<biases offset="4372556" size="2048"/>
			</blobs>
		</layer>
		<layer id="38" name="779" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="780" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="781" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4374604" size="1048576"/>
				<biases offset="5423180" size="2048"/>
			</blobs>
		</layer>
		<layer id="41" name="783" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="784" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5425228" size="294912"/>
				<biases offset="5720140" size="2048"/>
			</blobs>
		</layer>
		<layer id="43" name="786" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="787" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5722188" size="1048576"/>
				<biases offset="6770764" size="2048"/>
			</blobs>
		</layer>
		<layer id="45" name="789" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="790" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="791" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6772812" size="1048576"/>
				<biases offset="7821388" size="2048"/>
			</blobs>
		</layer>
		<layer id="48" name="793" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="794" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7823436" size="294912"/>
				<biases offset="8118348" size="2048"/>
			</blobs>
		</layer>
		<layer id="50" name="796" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="797" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8120396" size="1048576"/>
				<biases offset="9168972" size="2048"/>
			</blobs>
		</layer>
		<layer id="52" name="799" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="800" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="801" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9171020" size="1048576"/>
				<biases offset="10219596" size="2048"/>
			</blobs>
		</layer>
		<layer id="55" name="803" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="804" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10221644" size="294912"/>
				<biases offset="10516556" size="2048"/>
			</blobs>
		</layer>
		<layer id="57" name="806" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="807" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10518604" size="1048576"/>
				<biases offset="11567180" size="2048"/>
			</blobs>
		</layer>
		<layer id="59" name="809" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="810" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="1081" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11569228" size="524288"/>
				<biases offset="12093516" size="1024"/>
			</blobs>
		</layer>
		<layer id="62" name="811" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12094540" size="2097152"/>
				<biases offset="14191692" size="4096"/>
			</blobs>
		</layer>
		<layer id="63" name="813" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="814" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14195788" size="1179648"/>
				<biases offset="15375436" size="4096"/>
			</blobs>
		</layer>
		<layer id="65" name="816" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="817" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15379532" size="4194304"/>
				<biases offset="19573836" size="4096"/>
			</blobs>
		</layer>
		<layer id="67" name="819" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>100</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="19577932" size="2097152"/>
				<biases offset="21675084" size="4096"/>
			</blobs>
		</layer>
		<layer id="68" name="821" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="822" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="823" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21679180" size="4194304"/>
				<biases offset="25873484" size="4096"/>
			</blobs>
		</layer>
		<layer id="71" name="825" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="826" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="25877580" size="1179648"/>
				<biases offset="27057228" size="4096"/>
			</blobs>
		</layer>
		<layer id="73" name="828" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="829" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="27061324" size="4194304"/>
				<biases offset="31255628" size="4096"/>
			</blobs>
		</layer>
		<layer id="75" name="831" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="832" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="833" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31259724" size="4194304"/>
				<biases offset="35454028" size="4096"/>
			</blobs>
		</layer>
		<layer id="78" name="835" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="836" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35458124" size="1179648"/>
				<biases offset="36637772" size="4096"/>
			</blobs>
		</layer>
		<layer id="80" name="838" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="839" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="36641868" size="4194304"/>
				<biases offset="40836172" size="4096"/>
			</blobs>
		</layer>
		<layer id="82" name="841" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="842" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="843" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40840268" size="4194304"/>
				<biases offset="45034572" size="4096"/>
			</blobs>
		</layer>
		<layer id="85" name="845" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="846" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="45038668" size="1179648"/>
				<biases offset="46218316" size="4096"/>
			</blobs>
		</layer>
		<layer id="87" name="848" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="849" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="46222412" size="4194304"/>
				<biases offset="50416716" size="4096"/>
			</blobs>
		</layer>
		<layer id="89" name="851" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="852" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="853" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="50420812" size="4194304"/>
				<biases offset="54615116" size="4096"/>
			</blobs>
		</layer>
		<layer id="92" name="855" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="856" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="54619212" size="1179648"/>
				<biases offset="55798860" size="4096"/>
			</blobs>
		</layer>
		<layer id="94" name="858" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="859" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="55802956" size="4194304"/>
				<biases offset="59997260" size="4096"/>
			</blobs>
		</layer>
		<layer id="96" name="861" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="862" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="863" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="60001356" size="4194304"/>
				<biases offset="64195660" size="4096"/>
			</blobs>
		</layer>
		<layer id="99" name="865" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="866" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="64199756" size="1179648"/>
				<biases offset="65379404" size="4096"/>
			</blobs>
		</layer>
		<layer id="101" name="868" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="869" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="65383500" size="4194304"/>
				<biases offset="69577804" size="4096"/>
			</blobs>
		</layer>
		<layer id="103" name="871" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="872" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="873" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="69581900" size="4194304"/>
				<biases offset="73776204" size="4096"/>
			</blobs>
		</layer>
		<layer id="106" name="875" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="876" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="73780300" size="1179648"/>
				<biases offset="74959948" size="4096"/>
			</blobs>
		</layer>
		<layer id="108" name="878" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="879" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="74964044" size="4194304"/>
				<biases offset="79158348" size="4096"/>
			</blobs>
		</layer>
		<layer id="110" name="881" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="882" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>50</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
